13/data/attachments/14b3bb2b11f29818.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_3c8a0704-8b02-4096-98b0-98a5ba4016fe</nif:username>
            <nif:friendToBeAdded>Robert_task_Friend_96135_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>